New plan:

```diff
Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3-policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3-policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:ListBucketVersions",
            ]
          + resources = [
              + "arn:aws:s3:::trade-tariff-persistence-development",
              + "arn:aws:s3:::trade-tariff-persistence-production",
              + "arn:aws:s3:::trade-tariff-persistence-staging",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:DeleteObjectTagging",
              + "s3:DeleteObjectVersion",
              + "s3:DeleteObjectVersionTagging",
              + "s3:GetObject",
              + "s3:GetObjectAcl",
              + "s3:GetObjectTagging",
              + "s3:GetObjectTorrent",
              + "s3:GetObjectVersion",
              + "s3:GetObjectVersionAcl",
              + "s3:GetObjectVersionTagging",
              + "s3:GetObjectVersionTorrent",
              + "s3:ListMultipartUploadParts",
              + "s3:PutObject",
              + "s3:PutObjectAcl",
              + "s3:PutObjectTagging",
              + "s3:PutObjectVersionAcl",
              + "s3:PutObjectVersionTagging",
              + "s3:RestoreObject",
            ]
          + resources = [
              + "arn:aws:s3:::trade-tariff-persistence-development",
              + "arn:aws:s3:::trade-tariff-persistence-production",
              + "arn:aws:s3:::trade-tariff-persistence-staging",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # aws_iam_user_policy.policy will be updated in-place
  ~ resource "aws_iam_user_policy" "policy" {
        id     = "trade-tariff-service-account:s3-bucket-read-write"
        name   = "s3-bucket-read-write"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucketVersions",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::trade-tariff-persistence-staging",
                          - "arn:aws:s3:::trade-tariff-persistence-production",
                          - "arn:aws:s3:::trade-tariff-persistence-development",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:RestoreObject",
                          - "s3:PutObjectVersionTagging",
                          - "s3:PutObjectVersionAcl",
                          - "s3:PutObjectTagging",
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                          - "s3:ListMultipartUploadParts",
                          - "s3:GetObjectVersionTorrent",
                          - "s3:GetObjectVersionTagging",
                          - "s3:GetObjectVersionAcl",
                          - "s3:GetObjectVersion",
                          - "s3:GetObjectTorrent",
                          - "s3:GetObjectTagging",
                          - "s3:GetObjectAcl",
                          - "s3:GetObject",
                          - "s3:DeleteObjectVersionTagging",
                          - "s3:DeleteObjectVersion",
                          - "s3:DeleteObjectTagging",
                          - "s3:DeleteObject",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::trade-tariff-persistence-staging/*",
                          - "arn:aws:s3:::trade-tariff-persistence-production/*",
                          - "arn:aws:s3:::trade-tariff-persistence-development/*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket.opensearch_config[0] will be created
  + resource "aws_s3_bucket" "opensearch_config" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-opensearch-config-development"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "development"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "development"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_config[1] will be created
  + resource "aws_s3_bucket" "opensearch_config" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-opensearch-config-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_config[2] will be created
  + resource "aws_s3_bucket" "opensearch_config" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-opensearch-config-production"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_snapshots_uk[0] will be created
  + resource "aws_s3_bucket" "opensearch_snapshots_uk" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-uk-opensearch-snapshots-development"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "development"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "development"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_snapshots_uk[1] will be created
  + resource "aws_s3_bucket" "opensearch_snapshots_uk" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-uk-opensearch-snapshots-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_snapshots_uk[2] will be created
  + resource "aws_s3_bucket" "opensearch_snapshots_uk" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-uk-opensearch-snapshots-production"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_snapshots_xi[0] will be created
  + resource "aws_s3_bucket" "opensearch_snapshots_xi" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-xi-opensearch-snapshots-development"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "development"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "development"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_snapshots_xi[1] will be created
  + resource "aws_s3_bucket" "opensearch_snapshots_xi" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-xi-opensearch-snapshots-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.opensearch_snapshots_xi[2] will be created
  + resource "aws_s3_bucket" "opensearch_snapshots_xi" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trade-tariff-xi-opensearch-snapshots-production"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "production"
          + "Project"     = "trade-tariff"
        }
      + tags_all                    = {
          + "Environment" = "production"
          + "Project"     = "trade-tariff"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.acls[0] will be destroyed
  # (because aws_s3_bucket_public_access_block.acls is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "acls" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "trade-tariff-persistence-development" -> null
      - id                      = "trade-tariff-persistence-development" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.acls[1] will be destroyed
  # (because aws_s3_bucket_public_access_block.acls is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "acls" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "trade-tariff-persistence-staging" -> null
      - id                      = "trade-tariff-persistence-staging" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.acls[2] will be destroyed
  # (because aws_s3_bucket_public_access_block.acls is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "acls" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "trade-tariff-persistence-production" -> null
      - id                      = "trade-tariff-persistence-production" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # aws_s3_bucket_public_access_block.opensearch_snapshots_uk[0] will be created
  + resource "aws_s3_bucket_public_access_block" "opensearch_snapshots_uk" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.opensearch_snapshots_uk[1] will be created
  + resource "aws_s3_bucket_public_access_block" "opensearch_snapshots_uk" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.opensearch_snapshots_uk[2] will be created
  + resource "aws_s3_bucket_public_access_block" "opensearch_snapshots_uk" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.opensearch_snapshots_xi[0] will be created
  + resource "aws_s3_bucket_public_access_block" "opensearch_snapshots_xi" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.opensearch_snapshots_xi[1] will be created
  + resource "aws_s3_bucket_public_access_block" "opensearch_snapshots_xi" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.opensearch_snapshots_xi[2] will be created
  + resource "aws_s3_bucket_public_access_block" "opensearch_snapshots_xi" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.persistence[0] will be created
  + resource "aws_s3_bucket_public_access_block" "persistence" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "trade-tariff-persistence-development"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.persistence[1] will be created
  + resource "aws_s3_bucket_public_access_block" "persistence" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "trade-tariff-persistence-staging"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.persistence[2] will be created
  + resource "aws_s3_bucket_public_access_block" "persistence" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "trade-tariff-persistence-production"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 18 to add, 1 to change, 3 to destroy.
```